load-test.yml
# Artillery load test for /submit endpoint using a raw `session` cookie value
# This version skips the /auth step (Firebase Google auth) and sends a raw
# `session` cookie taken from the payload. Put a valid session token in the
# `session` column of `load-test-payload.csv` or use test tokens for local dev.

config:
  target: "http://localhost:3000"
  phases:
    - duration: 60      # test length in seconds
      arrivalRate: 5    # new virtual users per second
      rampTo: 20        # ramp up to 20 rps over the duration
  defaults:
    headers:
      Content-Type: "application/json"
  http:
    pool: 100

payload:
  path: "./load-test-payload.csv"
  fields:
    - session
    - githubLink
    - pptLink
    - videoLink
    - description

scenarios:
  - name: Submit flow (using raw session cookie)
    flow:
      - post:
          url: "/submit"
          headers:
            # `session` from payload is expected to be the raw token string.
            # Artillery will substitute it into the Cookie header as `session=<token>`.
            Cookie: "session={{ session }}"
            Content-Type: "application/json"
          json:
            githubLink: "{{ githubLink }}"
            pptLink: "{{ pptLink }}"
            videoLink: "{{ videoLink }}"
            description: "{{ description }}"

# Notes:
# - Use a valid `session` token issued by your production/dev server if you want
#   authentication to pass. For local load tests you can use a test token that
#   your server accepts.
# - If your cookie value already contains `session=` prefix in the CSV, change
#   the header to `Cookie: "{{ session }}"` instead.
# - To run: `artillery run ./load-test.yml` (see README in project for setup)